<h1>Base de Datos 3</h1>

<h2>Sentencias <code>INSERT INTO</code> , <code>UPDATE</code>, <code>DELETE</code>, <code>ALTER</code> y <code>DROP</code> </h2>

<h2>Uso de <code>INSERT INTO</code> en SQL y Creación de Tablas</h2>

<p>En SQL, la instrucción <code>INSERT INTO</code> se utiliza para agregar registros a una tabla existente, como ya hemos visto. Sin embargo, antes de realizar una operación de inserción, es importante haber creado la tabla con las restricciones necesarias que definirán la estructura y reglas de los datos permitidos en la tabla.</p>

<h3 style="color: #3498db;">Restricciones Comunes en la Creación de Tablas</h3>

<p>Las restricciones (o <em>constraints</em>) ayudan a asegurar la integridad de los datos y a prevenir errores comunes en las bases de datos. Estas restricciones se configuran al crear o modificar una tabla, y afectan las operaciones <code>INSERT</code>. A continuación, se describen algunas de las más comunes:</p>

<ul>
    <li><strong>PRIMARY KEY</strong>: Asegura que cada registro en una columna (o conjunto de columnas) sea único y no nulo. Sirve para identificar registros de forma exclusiva.</li>
    <li><strong>FOREIGN KEY</strong>: Establece una relación entre tablas, asegurando que el valor de la columna de referencia exista en otra tabla.</li>
    <li><strong>UNIQUE</strong>: Garantiza que todos los valores en una columna específica sean únicos.</li>
    <li><strong>NOT NULL</strong>: Impide que se inserten valores nulos en una columna.</li>
    <li><strong>CHECK</strong>: Define una condición que los datos deben cumplir al insertarse.</li>
    <li><strong>DEFAULT</strong>: Establece un valor predeterminado para una columna si no se proporciona uno en la instrucción <code>INSERT</code>.</li>
</ul>

<p>Por ejemplo, al crear una tabla <code>clientes</code>, podríamos establecer restricciones como <code>PRIMARY KEY</code> y <code>UNIQUE</code> para asegurar la integridad de los datos:</p>

<pre style="padding: 10px;">
<code>CREATE TABLE clientes (
    cliente_id INT PRIMARY KEY,
    email VARCHAR(100) UNIQUE,
    nombre VARCHAR(50) NOT NULL
);</code>
</pre>

<h3 style="color: #3498db;">Ejemplo de Uso de <code>INSERT INTO</code></h3>

<p>Una vez creada la tabla con sus restricciones, puedes utilizar <code>INSERT INTO</code> para agregar registros:</p>

<pre style="padding: 10px;">
<code>INSERT INTO clientes (cliente_id, email, nombre)
VALUES (1, 'correo@ejemplo.com', 'Juan Pérez');</code>
</pre>

<p>Si el <code>INSERT</code> no cumple con alguna de las restricciones, se producirá un error y la inserción fallará. Por ejemplo, intentar agregar un registro con un <code>cliente_id</code> duplicado o un <code>email</code> que ya exista, generará un error.</p>

<p>Es importante planificar y definir adecuadamente las restricciones en la creación de las tablas para mantener la integridad de los datos y reducir errores en las operaciones <code>INSERT</code>.</p>

<h2>Uso de <code>UPDATE</code> en SQL y Restricciones en las Tablas</h2>

<p>En SQL, la instrucción <code>UPDATE</code> se utiliza para modificar los datos de registros existentes en una tabla. La estructura básica de una sentencia <code>UPDATE</code> es la siguiente:</p>

<h3 style="color: #3498db;">Sintaxis de <code>UPDATE</code></h3>

<pre style="padding: 10px;">
<code>UPDATE nombre_tabla
SET columna1 = valor1, columna2 = valor2, ...
WHERE condicion;</code>
</pre>

<ul>
    <li><strong><code>nombre_tabla</code></strong>: Es el nombre de la tabla en la que queremos realizar la actualización.</li>
    <li><strong><code>SET</code></strong>: Palabra clave que indica el inicio de las columnas y valores que queremos modificar.</li>
    <li><strong><code>columna1 = valor1, columna2 = valor2, ...</code></strong>: Especifica las columnas que se van a actualizar y los nuevos valores para cada una. Puedes modificar una o varias columnas en una sola instrucción <code>UPDATE</code>.</li>
    <li><strong><code>WHERE</code></strong>: Condición que define qué registros se van a actualizar. Es importante usar esta cláusula para evitar modificar todos los registros de la tabla.</li>
</ul>

<p>Si no se incluye una cláusula <code>WHERE</code>, se actualizarán <strong>todos los registros</strong> de la tabla, lo cual puede no ser el comportamiento deseado.</p>

<h3 style="color: #3498db;">Restricciones Comunes que Afectan <code>UPDATE</code></h3>

<p>Al realizar una operación <code>UPDATE</code>, es fundamental tener en cuenta las restricciones (<em>constraints</em>) definidas en la tabla, ya que limitan los valores permitidos y ayudan a mantener la integridad de los datos. A continuación se detallan las principales restricciones que afectan la actualización de registros:</p>

<ul>
    <li><strong>PRIMARY KEY</strong>: La clave primaria debe ser única y no nula. No se debe modificar su valor, ya que es la identificación única del registro.</li>
    <li><strong>FOREIGN KEY</strong>: La clave foránea debe existir en la tabla de referencia. No se puede actualizar un valor que rompa esta relación.</li>
    <li><strong>UNIQUE</strong>: Asegura que no existan valores duplicados en una columna específica. Al actualizar, hay que garantizar que el nuevo valor no cause duplicados.</li>
    <li><strong>NOT NULL</strong>: Impide que una columna tenga valores nulos. Al realizar <code>UPDATE</code>, el nuevo valor debe ser diferente de <code>NULL</code> si la columna tiene esta restricción.</li>
    <li><strong>CHECK</strong>: Define una condición que los datos deben cumplir al ser actualizados.</li>
</ul>

<p>Es importante respetar estas restricciones al actualizar los registros para evitar errores y mantener la integridad de los datos.</p>

<h3 style="color: #3498db;">Ejemplo de Uso de <code>UPDATE</code></h3>

<p>Supongamos que tenemos una tabla <code>clientes</code> con las siguientes restricciones:</p>

<pre style= padding: 10px;">
<code>CREATE TABLE clientes (
    cliente_id INT PRIMARY KEY,
    email VARCHAR(100) UNIQUE,
    nombre VARCHAR(50) NOT NULL,
    edad INT CHECK (edad >= 18)
);</code>
</pre>

<p>Para actualizar el nombre y la edad de un cliente específico, podemos usar la instrucción <code>UPDATE</code> con una condición <code>WHERE</code> para especificar el registro que queremos modificar:</p>

<pre style= padding: 10px;">
<code>UPDATE clientes
SET nombre = 'Juan Pérez', edad = 30
WHERE cliente_id = 1;</code>
</pre>

<p>Si la actualización viola alguna restricción (por ejemplo, poner un <code>email</code> duplicado o una <code>edad</code> menor a 18), la operación fallará. Por lo tanto, es importante conocer y respetar las restricciones definidas en la tabla.</p>

<p>Planificar y definir adecuadamente las restricciones en la creación de las tablas es clave para evitar errores y mantener la coherencia de los datos en operaciones de actualización.</p>

<h3>Creamos las Tablas</h3>
<p>A continuación, vamos a crear las tablas que nos servirán para realizar los ejercicios.</p>
<p>Realizamos la conexión a nuestra base de datos SQLITE, que se encuentra en memoria, y generamos las tablas e insertamos los datos.</p>

In [2]:
%load_ext sql

# Conectarse a una base de datos SQLite en memoria
%sql sqlite:///:memory:

<h5>1. Creamos una Tabla llamada <code>CLIENTES</code></h5>

In [3]:
%%sql
CREATE TABLE Clientes (
    cliente_id INTEGER PRIMARY KEY,
    nombre VARCHAR(50),
    apellido VARCHAR(50),
    pais VARCHAR(50),
    edad INTEGER
);

 * sqlite:///:memory:
Done.

[]

In [4]:
%%sql
CREATE TABLE Pedidos (
    pedido_id INT PRIMARY KEY,
    fecha DATE,
    producto VARCHAR(50),
    cantidad INT,
    cliente_id INT,
    pendiente BOOLEAN,
    FOREIGN KEY (cliente_id) REFERENCES Clientes(cliente_id)
);

 * sqlite:///:memory:
Done.

[]

<h5>3. Creamos la Tabla <code>Empleados</code></h5>

In [5]:
%%sql
CREATE TABLE Empleados (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nombre TEXT NOT NULL,
    departamento TEXT NOT NULL,
    salario REAL NOT NULL,
    correo TEXT
);

 * sqlite:///:memory:
Done.

[]

<h3>Insertamos datos en la tabla <b>Clientes</b>:</h3>

In [6]:
%%sql
INSERT INTO Clientes (cliente_id, nombre, apellido, pais, edad) VALUES
(1, 'Juan', 'Pérez', 'España', 30),
(2, 'Ana', 'García', 'México', 25),
(3, 'Luis', 'Martínez', 'Argentina', 35),
(4, NULL, NULL,NULL, NULL),
(5, 'Carlos', 'González', 'Colombia', 40),
(6, 'Laura', 'Fernández', 'Chile', 22),
(7, 'Pedro', 'Sánchez', 'España', 31),
(8, 'Jhon', 'Doe', 'Reino Unido', 29),
(9, 'Isabel', 'Núñez', 'México', 26),
(10, 'Miguel', 'Romero', 'Perú', 33);

 * sqlite:///:memory:
10 rows affected.

[]


<h3>Insertamos datos en la tabla <b>Pedidos</b>:</h3>

In [7]:
%%sql
INSERT INTO Pedidos (pedido_id, fecha, producto, cantidad, cliente_id, pendiente) VALUES
(1, '10-10-2024', 'Teclado', 5, 1, FALSE),
(2, '11-10-2024', 'Ratón', 3, 2, TRUE),
(3, '12-10-2024', 'Teclado', 4, 3, FALSE),
(4, '13-10-2024', 'Ratón', 2, NULL, TRUE),
(5, '14-10-2024', 'Monitor', 1, 5, FALSE),
(6, '15-10-2024', 'Teclado', 2, 6, TRUE),
(7, '16-10-2024', 'Ratón', 4, 7, FALSE),
(8, '17-10-2024', 'Teclado', 3, 8, TRUE),
(9, '18-10-2024', 'Monitor', 2, 9, FALSE),
(10, '19-10-2024', 'Ratón', 5, 10, TRUE);

 * sqlite:///:memory:
10 rows affected.

[]


<h3>Insertamos datos en la tabla <b>Empleados</b>:</h3>

In [8]:
%%sql
INSERT INTO Empleados (nombre, departamento, salario, correo) VALUES 
('Ana', 'Ventas', 3500, 'ana@empresa.com'),
('Luis', 'Ventas', 4200, 'luis@empresa.com'),
('María', 'Marketing', 5000, 'maria@empresa.com'),
('Carlos', 'Marketing', 4800, 'carlos@empresa.com'),
('Laura', 'IT', 6000, 'laura@empresa.com'),
('Jorge', 'IT', 6200, 'jorge@empresa.com'),
('Sofía', 'Ventas', 3900, NULL),
('Raúl', 'Recursos Humanos', 3700, 'raul@empresa.com'),
('Elena', 'Recursos Humanos', 4100, NULL),
('Marta', 'IT', 5700, 'marta@empresa.com');

 * sqlite:///:memory:
10 rows affected.

[]

In [9]:
%%sql
SELECT * FROM Empleados;

 * sqlite:///:memory:
Done.

[(1, 'Ana', 'Ventas', 3500.0, 'ana@empresa.com'),
 (2, 'Luis', 'Ventas', 4200.0, 'luis@empresa.com'),
 (3, 'María', 'Marketing', 5000.0, 'maria@empresa.com'),
 (4, 'Carlos', 'Marketing', 4800.0, 'carlos@empresa.com'),
 (5, 'Laura', 'IT', 6000.0, 'laura@empresa.com'),
 (6, 'Jorge', 'IT', 6200.0, 'jorge@empresa.com'),
 (7, 'Sofía', 'Ventas', 3900.0, None),
 (8, 'Raúl', 'Recursos Humanos', 3700.0, 'raul@empresa.com'),
 (9, 'Elena', 'Recursos Humanos', 4100.0, None),
 (10, 'Marta', 'IT', 5700.0, 'marta@empresa.com')]

<h2>Ejemplos de Uso de <code>UPDATE</code> en SQL</h2>

<p>A continuación, se muestran seis ejemplos de la instrucción <code>UPDATE</code> para modificar registros en las tablas <code>Clientes</code>, <code>Pedidos</code>, y <code>Empleados</code>. Los primeros cuatro son ejemplos correctos de actualización, mientras que los dos últimos generarán errores debido a violaciones de restricciones en las tablas.</p>

<h3 style="color: #3498db;">Ejemplos Correctos de <code>UPDATE</code></h3>

<p><strong>Ejemplo 1:</strong> Actualizar el país de un cliente específico en la tabla <code>Clientes</code>.</p>
<p>Mostramos el dato que contiene: la tabla Clientes, el registro número 1:</p>

In [10]:
%%sql
SELECT * FROM Clientes;

 * sqlite:///:memory:
Done.

[(1, 'Juan', 'Pérez', 'España', 30),
 (2, 'Ana', 'García', 'México', 25),
 (3, 'Luis', 'Martínez', 'Argentina', 35),
 (4, None, None, None, None),
 (5, 'Carlos', 'González', 'Colombia', 40),
 (6, 'Laura', 'Fernández', 'Chile', 22),
 (7, 'Pedro', 'Sánchez', 'España', 31),
 (8, 'Jhon', 'Doe', 'Reino Unido', 29),
 (9, 'Isabel', 'Núñez', 'México', 26),
 (10, 'Miguel', 'Romero', 'Perú', 33)]

<p>Actualizamos el campo pais de España a Brasil:</p>

In [11]:
%%sql
UPDATE Clientes
SET pais = 'España'
WHERE Cliente_ID = '2';

 * sqlite:///:memory:
1 rows affected.

[]

<p>Quedando así:</p>

In [12]:
%%sql
SELECT * FROM Clientes 
WHERE cliente_id=1;

 * sqlite:///:memory:
Done.

[(1, 'Juan', 'Pérez', 'España', 30)]


<p><strong>Ejemplo 2:</strong> Cambiar la cantidad de un pedido en la tabla <code>Pedidos</code>.</p>

<p>Mostramos los datos que contiene: la tabla Pedidos, el registro número 3:</p>

In [13]:
%%sql
SELECT * FROM Pedidos 
WHERE pedido_id=3;

 * sqlite:///:memory:
Done.

[(3, '12-10-2024', 'Teclado', 4, 3, 0)]

<p>Actualizamos el campo cantidad de 4 a 10 del registro número 3:</p>

In [14]:
%%sql
UPDATE Pedidos
SET cantidad = 10
WHERE pedido_id = 3;

 * sqlite:///:memory:
1 rows affected.

[]

<p>Quedando así:</p>

In [15]:
%%sql
SELECT * FROM Pedidos 
WHERE pedido_id=3;

 * sqlite:///:memory:
Done.

[(3, '12-10-2024', 'Teclado', 10, 3, 0)]


<p><strong>Ejemplo 3:</strong> Modificar el salario de un empleado en la tabla <code>Empleados</code>.</p>

In [16]:
%%sql
SELECT * FROM Empleados;

 * sqlite:///:memory:
Done.

[(1, 'Ana', 'Ventas', 3500.0, 'ana@empresa.com'),
 (2, 'Luis', 'Ventas', 4200.0, 'luis@empresa.com'),
 (3, 'María', 'Marketing', 5000.0, 'maria@empresa.com'),
 (4, 'Carlos', 'Marketing', 4800.0, 'carlos@empresa.com'),
 (5, 'Laura', 'IT', 6000.0, 'laura@empresa.com'),
 (6, 'Jorge', 'IT', 6200.0, 'jorge@empresa.com'),
 (7, 'Sofía', 'Ventas', 3900.0, None),
 (8, 'Raúl', 'Recursos Humanos', 3700.0, 'raul@empresa.com'),
 (9, 'Elena', 'Recursos Humanos', 4100.0, None),
 (10, 'Marta', 'IT', 5700.0, 'marta@empresa.com')]

In [17]:
%%sql
UPDATE Empleados
SET salario = 5500
WHERE nombre = 'Ana';

 * sqlite:///:memory:
1 rows affected.

[]


<p><strong>Ejemplo 4:</strong> Actualizar el estado de un pedido a "pendiente" en la tabla <code>Pedidos</code>.</p>

In [18]:
%%sql
SELECT * FROM Pedidos;

 * sqlite:///:memory:
Done.

[(1, '10-10-2024', 'Teclado', 5, 1, 0),
 (2, '11-10-2024', 'Ratón', 3, 2, 1),
 (3, '12-10-2024', 'Teclado', 10, 3, 0),
 (4, '13-10-2024', 'Ratón', 2, None, 1),
 (5, '14-10-2024', 'Monitor', 1, 5, 0),
 (6, '15-10-2024', 'Teclado', 2, 6, 1),
 (7, '16-10-2024', 'Ratón', 4, 7, 0),
 (8, '17-10-2024', 'Teclado', 3, 8, 1),
 (9, '18-10-2024', 'Monitor', 2, 9, 0),
 (10, '19-10-2024', 'Ratón', 5, 10, 1)]

In [19]:
%%sql
UPDATE Pedidos
SET pendiente = TRUE
WHERE pedido_id = 5;

 * sqlite:///:memory:
1 rows affected.

[]


<h3 style="color: #e74c3c;">Ejemplos de <code>UPDATE</code> que Generarán Errores</h3>

<p><strong>Ejemplo 5:</strong> Intentar actualizar un valor en la columna <code>cliente_id</code> de la tabla <code>Pedidos</code> con un ID de cliente inexistente (viola la restricción <code>FOREIGN KEY</code>).</p>

In [20]:
%%sql
UPDATE Pedidos
SET cliente_id = 999
WHERE pedido_id = 2;

 * sqlite:///:memory:
1 rows affected.

[]

In [21]:
%%sql
SELECT * FROM Pedidos;

 * sqlite:///:memory:
Done.

[(1, '10-10-2024', 'Teclado', 5, 1, 0),
 (2, '11-10-2024', 'Ratón', 3, 999, 1),
 (3, '12-10-2024', 'Teclado', 10, 3, 0),
 (4, '13-10-2024', 'Ratón', 2, None, 1),
 (5, '14-10-2024', 'Monitor', 1, 5, 1),
 (6, '15-10-2024', 'Teclado', 2, 6, 1),
 (7, '16-10-2024', 'Ratón', 4, 7, 0),
 (8, '17-10-2024', 'Teclado', 3, 8, 1),
 (9, '18-10-2024', 'Monitor', 2, 9, 0),
 (10, '19-10-2024', 'Ratón', 5, 10, 1)]


<p><strong>Ejemplo 6:</strong> Intentar modificar el <code>cliente_id</code> en la tabla <code>Clientes</code> a <code>NULL</code>, lo cual violaría la restricción <code>PRIMARY KEY</code>.</p>

In [22]:
%%sql
UPDATE Clientes
SET cliente_id = NULL
WHERE cliente_id = 3;

 * sqlite:///:memory:
(sqlite3.IntegrityError) datatype mismatch
[SQL: UPDATE Clientes
SET cliente_id = NULL
WHERE cliente_id = 3;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)


<p>En estos últimos ejemplos, las restricciones <em>FOREIGN KEY</em> y <em>PRIMARY KEY</em> impedirán que la instrucción <code>UPDATE</code> se ejecute correctamente, generando un error.</p>

<h2>Sentencia <code>DELETE</code> en SQL</h2>

<p>La instrucción <code>DELETE</code> se utiliza para eliminar registros de una tabla en una base de datos. Al igual que con las sentencias de actualización, es importante usar condiciones adecuadas para evitar eliminar todos los registros accidentalmente.</p>

<h3 style="color: #e74c3c;">Ejemplo de uso de <code>DELETE</code> en SQL</h3>

<p>Supongamos que queremos eliminar un cliente específico en la tabla <code>clientes</code> donde el <code>id</code> sea igual a un valor determinado. La sentencia SQL sería:</p>

<pre><code>DELETE FROM clientes WHERE id = ?;</code></pre>

<p>Es recomendable utilizar la cláusula <code>WHERE</code> para especificar el registro exacto que deseas eliminar.</p>

<h3 style="color: #e74c3c;">Precaución</h3>
<p>Si omites la condición <code>WHERE</code>, todos los registros de la tabla serán eliminados. Por eso, asegúrate de definir claramente la condición de borrado.</p>

<h2>Comandos ALTER y DROP en SQL</h2>

<h3>Comando ALTER</h3>
<p>El comando <strong>ALTER</strong> se utiliza para modificar la estructura de una tabla existente en una base de datos. Este comando permite añadir, eliminar o modificar columnas, así como definir o cambiar las restricciones de las mismas.</p>
<p>Algunos usos comunes del comando ALTER:</p>
<ul>
  <li><code>ALTER TABLE nombre_tabla ADD columna tipo_dato;</code>: Añade una nueva columna a la tabla.</li>
  <li><code>ALTER TABLE nombre_tabla DROP COLUMN columna;</code>: Elimina una columna de la tabla.</li>
  <li><code>ALTER TABLE nombre_tabla MODIFY columna tipo_dato;</code>: Modifica el tipo de dato de una columna.</li>
</ul>

<h2>Ejemplos de ALTER ADD, DROP y MODIFY en SQL</h2>

<h3>Ejemplo de ALTER ADD</h3>

In [23]:
%%sql
select * from clientes;

 * sqlite:///:memory:
Done.

[(1, 'Juan', 'Pérez', 'España', 30),
 (2, 'Ana', 'García', 'España', 25),
 (3, 'Luis', 'Martínez', 'Argentina', 35),
 (4, None, None, None, None),
 (5, 'Carlos', 'González', 'Colombia', 40),
 (6, 'Laura', 'Fernández', 'Chile', 22),
 (7, 'Pedro', 'Sánchez', 'España', 31),
 (8, 'Jhon', 'Doe', 'Reino Unido', 29),
 (9, 'Isabel', 'Núñez', 'México', 26),
 (10, 'Miguel', 'Romero', 'Perú', 33)]


<p>El siguiente ejemplo agrega una nueva columna <code>calle</code> de tipo <code>Varchar(50)</code> a la tabla <code>clientes</code>:</p>

In [24]:
%%sql
ALTER TABLE clientes
ADD calle VARCHAR(50);

SELECT * FROM clientes;

 * sqlite:///:memory:
Done.
Done.

[(1, 'Juan', 'Pérez', 'España', 30, None),
 (2, 'Ana', 'García', 'España', 25, None),
 (3, 'Luis', 'Martínez', 'Argentina', 35, None),
 (4, None, None, None, None, None),
 (5, 'Carlos', 'González', 'Colombia', 40, None),
 (6, 'Laura', 'Fernández', 'Chile', 22, None),
 (7, 'Pedro', 'Sánchez', 'España', 31, None),
 (8, 'Jhon', 'Doe', 'Reino Unido', 29, None),
 (9, 'Isabel', 'Núñez', 'México', 26, None),
 (10, 'Miguel', 'Romero', 'Perú', 33, None)]


<h3>Ejemplo de ALTER DROP</h3>
<p>Este ejemplo elimina la columna <code>calle</code> de la tabla <code>clientes</code>:</p>

In [25]:
%%sql
ALTER TABLE clientes
DROP COLUMN calle;

SELECT * FROM clientes;

 * sqlite:///:memory:
Done.
Done.

[(1, 'Juan', 'Pérez', 'España', 30),
 (2, 'Ana', 'García', 'España', 25),
 (3, 'Luis', 'Martínez', 'Argentina', 35),
 (4, None, None, None, None),
 (5, 'Carlos', 'González', 'Colombia', 40),
 (6, 'Laura', 'Fernández', 'Chile', 22),
 (7, 'Pedro', 'Sánchez', 'España', 31),
 (8, 'Jhon', 'Doe', 'Reino Unido', 29),
 (9, 'Isabel', 'Núñez', 'México', 26),
 (10, 'Miguel', 'Romero', 'Perú', 33)]


<h3>Ejemplo de ALTER MODIFY</h3>
<p>En este ejemplo, se modifica la columna <code>nombre</code> de la tabla <code>clientes</code> para que sea de tipo <code>VARCHAR(100)</code>, pero antes vamos a ver como se ve la estructura de una tabla.</p>

<h2>Ver la Estructura de una Tabla en SQLite</h2>

<h3>Método 1: Usando PRAGMA</h3>
<p>El siguiente comando muestra la estructura de la tabla <code>clientes</code>, incluyendo el nombre de cada columna, tipo de datos, si permite valores nulos, y si es una clave primaria:</p>

In [26]:
%%sql
PRAGMA table_info(clientes);

 * sqlite:///:memory:
Done.

[(0, 'cliente_id', 'INTEGER', 0, None, 1),
 (1, 'nombre', 'VARCHAR(50)', 0, None, 0),
 (2, 'apellido', 'VARCHAR(50)', 0, None, 0),
 (3, 'pais', 'VARCHAR(50)', 0, None, 0),
 (4, 'edad', 'INTEGER', 0, None, 0)]


<h3>Método 2: Usando sqlite_master</h3>
<p>El siguiente comando consulta la tabla <code>sqlite_master</code> para obtener información sobre la estructura de la tabla <code>clientes</code>:</p>

In [27]:
%%sql
SELECT name, sql FROM sqlite_master WHERE type='table';

 * sqlite:///:memory:
Done.

[('Clientes', 'CREATE TABLE Clientes (\n    cliente_id INTEGER PRIMARY KEY,\n    nombre VARCHAR(50),\n    apellido VARCHAR(50),\n    pais VARCHAR(50),\n    edad INTEGER\n)'),
 ('Pedidos', 'CREATE TABLE Pedidos (\n    pedido_id INT PRIMARY KEY,\n    fecha DATE,\n    producto VARCHAR(50),\n    cantidad INT,\n    cliente_id INT,\n    pendiente BOOLEAN,\n    FOREIGN KEY (cliente_id) REFERENCES Clientes(cliente_id)\n)'),
 ('Empleados', 'CREATE TABLE Empleados (\n    id INTEGER PRIMARY KEY AUTOINCREMENT,\n    nombre TEXT NOT NULL,\n    departamento TEXT NOT NULL,\n    salario REAL NOT NULL,\n    correo TEXT\n)'),
 ('sqlite_sequence', 'CREATE TABLE sqlite_sequence(name,seq)')]


<p>Este comando mostrará la sentencia SQL que define la estructura de la tabla, incluyendo las columnas y sus tipos de datos.</p>

In [ ]:
%%sql
ALTER TABLE Clientes
MODIFY nombre VARCHAR(100);

 * sqlite:///:memory:
(sqlite3.OperationalError) near "MODIFY": syntax error
[SQL: ALTER TABLE clientes
MODIFY nombre VARCHAR(100);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

<h2>Modificar el Tipo de una Columna en SQLite</h2>

<p>SQLite no soporta el comando <code>MODIFY</code> para cambiar el tipo de una columna. En su lugar, debes seguir estos pasos:</p>

<ol>
  <li><strong>Crear una nueva tabla con la estructura deseada.</strong></li>
  <p>Por ejemplo, si deseas cambiar la columna <code>nombre</code> a tipo <code>VARCHAR(100)</code>, crea la nueva tabla con el tipo de datos actualizado:</p>
  <pre><code>CREATE TABLE clientes_nueva (
    id INTEGER PRIMARY KEY,
    nombre VARCHAR(100),
    edad INTEGER
);</code></pre>

  <li><strong>Copiar los datos de la tabla original a la nueva tabla.</strong></li>
  <p>Usa una instrucción <code>INSERT INTO ... SELECT</code> para transferir los datos:</p>
  <pre><code>INSERT INTO clientes_nueva (id, nombre, edad)
SELECT id, nombre, edad FROM clientes;</code></pre>

  <li><strong>Eliminar la tabla original.</strong></li>
  <p>Elimina la tabla original con <code>DROP TABLE</code>:</p>
  <pre><code>DROP TABLE clientes;</code></pre>

  <li><strong>Renombrar la nueva tabla.</strong></li>
  <p>Cambia el nombre de la nueva tabla para que coincida con el de la tabla original:</p>
  <pre><code>ALTER TABLE clientes_nueva RENAME TO clientes;</code></pre>
</ol>

<p>Este procedimiento es la forma de cambiar el tipo de columna en SQLite, ya que no se puede hacer directamente con <code style="color: red;">MODIFY</code>.</p>


<h3 style= "color: red;">Comando DROP</h3>
<p style= "color: red;">El comando <strong><code>DROP</code></strong> se utiliza para eliminar objetos de la base de datos, como tablas, vistas, índices o bases de datos completas. Al usar este comando, los datos y la estructura del objeto se eliminan permanentemente, y no se pueden recuperar sin un respaldo previo.</p>
<p style= "color: red;">Ejemplos comunes del comando DROP:</p>
<ul>
  <li style= "color: red;"><code>DROP TABLE nombre_tabla;</code>: Elimina una tabla completa de la base de datos.</li>
  <li style= "color: red;"><code>DROP VIEW nombre_vista;</code>: Elimina una vista de la base de datos.</li>
  <li style= "color: red;"><code>DROP DATABASE nombre_base_datos;</code>: Elimina toda la base de datos.</li>
</ul>
<p style= "color: red;">Es importante tener cuidado al utilizar el comando DROP, ya que no se pueden recuperar los datos una vez eliminados.</p>